Projects/First_Benchmark/output/logs/int_queries_sysbench.log
sysbench 1.0.20 (using system LuaJIT 2.1.1725453128)

Tables KUNDENMITID and BESTELLUNGMITID have been successfully created.
sysbench 1.0.20 (using system LuaJIT 2.1.1725453128)

Running the test with following options:
Number of threads: 4
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 4 tps: 0.00 qps: 17896.55 (r/w/o: 0.00/4474.14/13422.41) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 4 tps: 0.00 qps: 19560.05 (r/w/o: 0.00/4890.01/14670.04) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 4 tps: 0.00 qps: 19778.09 (r/w/o: 0.00/4944.52/14833.57) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 4 tps: 0.00 qps: 19876.29 (r/w/o: 0.00/4969.07/14907.22) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 4 tps: 0.00 qps: 19957.23 (r/w/o: 0.00/4989.31/14967.92) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 4 tps: 0.00 qps: 19881.58 (r/w/o: 0.00/4970.39/14911.18) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 4 tps: 0.00 qps: 19746.14 (r/w/o: 0.00/4936.54/14809.61) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 4 tps: 0.00 qps: 19615.14 (r/w/o: 0.00/4903.78/14711.35) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 4 tps: 4.00 qps: 20274.47 (r/w/o: 4.00/3981.49/16288.99) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 4 tps: 0.00 qps: 23766.07 (r/w/o: 0.00/4458.39/19307.68) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 4 tps: 0.00 qps: 23773.40 (r/w/o: 0.00/4457.26/19316.14) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 4 tps: 0.00 qps: 23791.30 (r/w/o: 0.00/4475.84/19315.46) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 4 tps: 0.00 qps: 23774.59 (r/w/o: 0.00/4454.22/19320.36) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 4 tps: 0.00 qps: 23597.51 (r/w/o: 0.00/4420.78/19176.73) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 4 tps: 0.00 qps: 23766.34 (r/w/o: 0.00/4463.43/19302.91) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 4 tps: 4.00 qps: 18169.71 (r/w/o: 4.00/3396.06/14769.65) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 4 tps: 0.00 qps: 23737.95 (r/w/o: 0.00/4442.36/19295.58) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 4 tps: 0.00 qps: 23835.78 (r/w/o: 0.00/4442.18/19393.59) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 4 tps: 0.00 qps: 23705.36 (r/w/o: 0.00/4455.07/19250.28) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 0.00 qps: 23823.39 (r/w/o: 0.00/4446.62/19376.77) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 4 tps: 0.00 qps: 23641.14 (r/w/o: 0.00/4448.46/19192.68) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 4 tps: 0.00 qps: 22706.80 (r/w/o: 0.00/4253.54/18453.26) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 4 tps: 4.02 qps: 16421.18 (r/w/o: 4.02/3094.54/13322.62) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 4 tps: 0.00 qps: 23255.05 (r/w/o: 0.00/4360.07/18894.98) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 4 tps: 0.00 qps: 23751.82 (r/w/o: 0.00/4445.72/19306.11) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 4 tps: 0.00 qps: 23742.09 (r/w/o: 0.00/4432.39/19309.70) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 4 tps: 0.00 qps: 23770.07 (r/w/o: 0.00/4452.83/19317.25) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 4 tps: 0.00 qps: 23590.64 (r/w/o: 0.00/4429.06/19161.58) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 4 tps: 0.00 qps: 23616.76 (r/w/o: 0.00/4454.39/19162.37) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 4.00 qps: 14209.63 (r/w/o: 4.00/2647.30/11558.33) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 31s ] thds: 4 tps: 0.00 qps: 23572.66 (r/w/o: 0.00/4419.12/19153.54) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 32s ] thds: 4 tps: 0.00 qps: 23676.49 (r/w/o: 0.00/4442.09/19234.40) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 4 tps: 0.00 qps: 23432.73 (r/w/o: 0.00/4413.27/19019.46) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 34s ] thds: 4 tps: 0.00 qps: 23641.54 (r/w/o: 0.00/4424.42/19217.12) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 4 tps: 0.00 qps: 23562.96 (r/w/o: 0.00/4426.81/19136.15) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 4 tps: 0.00 qps: 23546.51 (r/w/o: 0.00/4425.58/19120.93) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 37s ] thds: 4 tps: 4.01 qps: 10414.68 (r/w/o: 4.01/1952.50/8458.17) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 38s ] thds: 4 tps: 0.00 qps: 23616.65 (r/w/o: 0.00/4414.75/19201.91) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 4 tps: 0.00 qps: 23515.58 (r/w/o: 0.00/4420.92/19094.66) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 0.00 qps: 23630.32 (r/w/o: 0.00/4448.59/19181.73) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 41s ] thds: 4 tps: 0.00 qps: 23656.17 (r/w/o: 0.00/4411.31/19244.87) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 4 tps: 0.00 qps: 23414.74 (r/w/o: 0.00/4385.26/19029.48) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 43s ] thds: 4 tps: 0.00 qps: 23365.28 (r/w/o: 0.00/4361.52/19003.76) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 44s ] thds: 4 tps: 0.00 qps: 14817.75 (r/w/o: 0.00/2789.79/12027.97) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 4 tps: 4.02 qps: 16915.25 (r/w/o: 4.02/3166.34/13744.89) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 46s ] thds: 4 tps: 0.00 qps: 23584.92 (r/w/o: 0.00/4426.43/19158.50) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 47s ] thds: 4 tps: 0.00 qps: 23641.40 (r/w/o: 0.00/4435.51/19205.89) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 4 tps: 0.00 qps: 23531.39 (r/w/o: 0.00/4436.39/19095.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 49s ] thds: 4 tps: 0.00 qps: 23504.62 (r/w/o: 0.00/4413.36/19091.25) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 0.00 qps: 23585.58 (r/w/o: 0.00/4438.79/19146.79) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 4 tps: 0.00 qps: 23519.51 (r/w/o: 0.00/4418.65/19100.86) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 52s ] thds: 4 tps: 4.00 qps: 3520.04 (r/w/o: 4.00/667.25/2848.79) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 53s ] thds: 4 tps: 0.00 qps: 23506.09 (r/w/o: 0.00/4395.37/19110.72) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 4 tps: 0.00 qps: 23218.83 (r/w/o: 0.00/4346.28/18872.55) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 4 tps: 0.00 qps: 23511.28 (r/w/o: 0.00/4405.49/19105.79) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 56s ] thds: 4 tps: 0.00 qps: 23519.80 (r/w/o: 0.00/4391.61/19128.19) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 4 tps: 0.00 qps: 23346.63 (r/w/o: 0.00/4364.48/18982.15) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 58s ] thds: 4 tps: 0.00 qps: 23219.14 (r/w/o: 0.00/4354.59/18864.55) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 59s ] thds: 4 tps: 0.00 qps: 18103.37 (r/w/o: 0.00/3390.89/14712.48) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 4.01 qps: 10228.29 (r/w/o: 4.01/1903.01/8321.27) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 61s ] thds: 4 tps: 0.00 qps: 23707.48 (r/w/o: 0.00/4421.99/19285.49) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 62s ] thds: 4 tps: 0.00 qps: 23617.76 (r/w/o: 0.00/4434.02/19183.74) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 63s ] thds: 4 tps: 0.00 qps: 23705.13 (r/w/o: 0.00/4429.39/19275.75) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 64s ] thds: 4 tps: 0.00 qps: 23685.52 (r/w/o: 0.00/4434.10/19251.42) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 4 tps: 0.00 qps: 23508.18 (r/w/o: 0.00/4420.72/19087.46) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 66s ] thds: 4 tps: 0.00 qps: 23485.32 (r/w/o: 0.00/4440.25/19045.07) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 67s ] thds: 4 tps: 0.00 qps: 8286.00 (r/w/o: 0.00/1565.07/6720.93) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            36
        write:                           279847
        other:                           1159577
        total:                           1439460
    transactions:                        36     (0.53 per sec.)
    queries:                             1439460 (21330.80 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          67.4820s
    total number of events:              36

Latency (ms):
         min:                                 6966.48
         avg:                                 7492.21
         max:                                 8279.38
         95th percentile:                        0.00
         sum:                               269719.45

Threads fairness:
    events (avg/stddev):           9.0000/0.00
    execution time (avg/stddev):   67.4299/0.04

sysbench 1.0.20 (using system LuaJIT 2.1.1725453128)

Cleanup successfully done