Projects/First_Benchmark/output/logs/varchar_queries_insert_sysbench.log
sysbench 1.0.20 (using system LuaJIT 2.1.1725453128)

Running the test with following options:
Number of threads: 8
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 8 tps: 0.00 qps: 46367.97 (r/w/o: 0.00/2020.84/44347.12) lat (ms,95%): 0.00 err/s: 20.80 reconn/s: 0.00
[ 10s ] thds: 8 tps: 0.00 qps: 46851.83 (r/w/o: 0.00/1952.13/44899.70) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 8 tps: 1.60 qps: 46816.97 (r/w/o: 0.00/2017.91/44799.05) lat (ms,95%): 0.00 err/s: 17.60 reconn/s: 0.00
[ 20s ] thds: 8 tps: 0.00 qps: 49330.94 (r/w/o: 0.00/2054.74/47276.20) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 8 tps: 1.60 qps: 46480.33 (r/w/o: 0.00/2002.30/44478.03) lat (ms,95%): 0.00 err/s: 15.20 reconn/s: 0.00
[ 30s ] thds: 8 tps: 0.00 qps: 49178.37 (r/w/o: 0.00/2047.89/47130.48) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 8 tps: 1.60 qps: 46210.79 (r/w/o: 0.00/2016.40/44194.39) lat (ms,95%): 0.00 err/s: 21.60 reconn/s: 0.00
[ 40s ] thds: 8 tps: 0.00 qps: 49903.51 (r/w/o: 0.00/2078.58/47824.93) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 8 tps: 1.60 qps: 46395.09 (r/w/o: 0.00/1981.61/44413.49) lat (ms,95%): 0.00 err/s: 12.40 reconn/s: 0.00
[ 50s ] thds: 8 tps: 0.00 qps: 49085.10 (r/w/o: 0.00/2045.10/47040.01) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 8 tps: 1.60 qps: 46507.23 (r/w/o: 0.00/2009.27/44497.96) lat (ms,95%): 0.00 err/s: 16.81 reconn/s: 0.00
[ 60s ] thds: 8 tps: 0.00 qps: 48729.45 (r/w/o: 0.00/2030.34/46699.11) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           122743
        other:                           2771526
        total:                           2894269
    transactions:                        48     (0.79 per sec.)
    queries:                             2894269 (47661.49 per sec.)
    ignored errors:                      522    (8.60 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.7253s
    total number of events:              48

Latency (ms):
         min:                                10019.07
         avg:                                10120.63
         max:                                10316.43
         95th percentile:                        0.00
         sum:                               485790.17

Threads fairness:
    events (avg/stddev):           6.0000/0.00
    execution time (avg/stddev):   60.7238/0.00