Projects/First_Benchmark/output/logs/varchar_queries_length_insert_sysbench.log
sysbench 1.0.20 (using system LuaJIT 2.1.1725453128)

Running the test with following options:
Number of threads: 8
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 8 tps: 0.00 qps: 22431.86 (r/w/o: 0.00/6793.29/15638.57) lat (ms,95%): 0.00 err/s: 2.00 reconn/s: 0.00
[ 10s ] thds: 8 tps: 0.00 qps: 22507.27 (r/w/o: 0.00/3420.13/19087.14) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 8 tps: 0.00 qps: 22243.28 (r/w/o: 0.00/2849.47/19393.80) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 0.00 qps: 22055.02 (r/w/o: 0.00/2798.91/19256.11) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 8 tps: 1.00 qps: 19277.77 (r/w/o: 0.00/8355.37/10922.40) lat (ms,95%): 0.00 err/s: 0.20 reconn/s: 0.00
[ 30s ] thds: 8 tps: 0.40 qps: 20948.55 (r/w/o: 0.00/6645.39/14303.17) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 8 tps: 0.00 qps: 21931.38 (r/w/o: 0.00/2786.79/19144.59) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 0.00 qps: 22119.31 (r/w/o: 0.00/2906.77/19212.53) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 8 tps: 0.60 qps: 19217.04 (r/w/o: 0.00/4020.38/15196.66) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 1.00 qps: 21646.11 (r/w/o: 0.00/8966.29/12679.82) lat (ms,95%): 0.00 err/s: 0.20 reconn/s: 0.00
[ 55s ] thds: 8 tps: 0.00 qps: 22180.37 (r/w/o: 0.00/3842.51/18337.86) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 0.00 qps: 22171.02 (r/w/o: 0.00/2778.75/19392.27) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 8 tps: 0.00 qps: 22087.43 (r/w/o: 0.00/2831.45/19255.98) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           297805
        other:                           1174134
        total:                           1471939
    transactions:                        23     (0.33 per sec.)
    queries:                             1471939 (21409.67 per sec.)
    ignored errors:                      12     (0.17 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          68.7510s
    total number of events:              23

Latency (ms):
         min:                                19981.84
         avg:                                23440.25
         max:                                46270.69
         95th percentile:                        0.00
         sum:                               539125.84

Threads fairness:
    events (avg/stddev):           2.8750/0.33
    execution time (avg/stddev):   67.3907/1.00